AUTO_config_TK_pesok/src/Documents/РасчетБонусов/РасчетБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетБонусов</name>
  <registerRecords>AccumulationRegister.АналитикаНачисленияМаркетинга</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеМаркетинга</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАссортиментногоКомитета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисление</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановкаМаркетинга</name>
      <type>
        <types>DocumentRef.ТК_УстановкаМаркетинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипБонуса</name>
      <type>
        <types>CatalogRef.ТипыБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСогласованная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>АктОбОказанииУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулировкаСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Произвольный комментарий к документу</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НеСоздаватьАктУслуг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДНачисления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйВидНачисления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументСчет</name>
      <type>
        <types>DocumentRef.СчетНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расчеты</name>
    <comment>Списываемые товары</comment>
    <attributes>
      <name>УстановкаМаркетинга</name>
      <type>
        <types>DocumentRef.ТК_УстановкаМаркетинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяБазаКонтрагента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяБаза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыеПлощадки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаНачисления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированныйБонус</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Произвольный комментарий к документу</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДУсловия</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналитикаРасчетов</name>
    <attributes>
      <name>УстановкаМаркетинга</name>
      <type>
        <types>DocumentRef.ТК_УстановкаМаркетинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипБонуса</name>
      <type>
        <types>CatalogRef.ТипыБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеКомпании</name>
      <type>
        <types>CatalogRef.ПодразделенияКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДУсловия</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДНачисления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/AccumulationRegisters/НачислениеМаркетинга/НачислениеМаркетинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеМаркетинга</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаРасчетная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСогласованная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НачалоРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность начисления маркетинга</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>АктОбОказанииУслуг</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
    </type>
  </attributes>
  <dimensions>
    <name>УстановкаМаркетинга</name>
    <type>
      <types>DocumentRef.ТК_УстановкаМаркетинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорМаркетинга</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/АналитикаНачисленияМаркетинга/АналитикаНачисленияМаркетинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АналитикаНачисленияМаркетинга</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасчетная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НачалоРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДУсловия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаМаркетинга</name>
    <type>
      <types>DocumentRef.ТК_УстановкаМаркетинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был зафиксирован факт продажи товара</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорМаркетинга</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБонуса</name>
    <type>
      <types>CatalogRef.ТипыБонусов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Documents/РасчетБонусов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор =  Пользователи.ТекущийПользователь(); 
	Организация = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	

КонецПроцедуры


#КонецЕсли

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НачислениеМаркетинга.Записывать = Истина;
	Движения.НачислениеМаркетинга.Очистить();
	
	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
		Движение = Движения.НачислениеМаркетинга.Добавить();
		Движение.Период = Дата;
		Движение.УстановкаМаркетинга = ТекСтрокаНачисление.УстановкаМаркетинга;
		Движение.Контрагент = ТекСтрокаНачисление.Контрагент;
		Движение.ДоговорМаркетинга = ТекСтрокаНачисление.Договор;
		Движение.Менеджер = ТекСтрокаНачисление.Менеджер;
		Движение.Периодичность = ТекСтрокаНачисление.УстановкаМаркетинга.Периодичность; 
		Движение.СуммаРасчетная = ТекСтрокаНачисление.СуммаРасчетная;
		Движение.СуммаСогласованная = ТекСтрокаНачисление.СуммаСогласованная;
		Движение.НачалоРасчета = ТекСтрокаНачисление.НачалоРасчета;
		Движение.КонецРасчета = ТекСтрокаНачисление.КонецРасчета;
		Движение.АктОбОказанииУслуг = ТекСтрокаНачисление.АктОбОказанииУслуг;
	КонецЦикла;
	
	ргАналитикаНачисленияМаркетинга = Движения.АналитикаНачисленияМаркетинга;		
	ргАналитикаНачисленияМаркетинга.Записывать = Истина;
	ргАналитикаНачисленияМаркетинга.Очистить();
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РасчетБонусовАналитикаРасчетов.НомерСтроки КАК НомерСтроки,
	                      |	РасчетБонусовНачисление.НачалоРасчета КАК Период,
	                      |	РасчетБонусовАналитикаРасчетов.УстановкаМаркетинга КАК УстановкаМаркетинга,
	                      |	РасчетБонусовНачисление.Договор КАК ДоговорМаркетинга,
	                      |	РасчетБонусовАналитикаРасчетов.Контрагент КАК Контрагент,
	                      |	РасчетБонусовАналитикаРасчетов.Организация КАК Организация,
	                      |	РасчетБонусовАналитикаРасчетов.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	РасчетБонусовАналитикаРасчетов.ТорговаяПлощадка КАК ТорговаяПлощадка,
	                      |	РасчетБонусовНачисление.Менеджер КАК Менеджер,
	                      |	РасчетБонусовАналитикаРасчетов.Номенклатура КАК Номенклатура,
	                      |	РасчетБонусовНачисление.ТипБонуса КАК ТипБонуса,
	                      |	РасчетБонусовАналитикаРасчетов.СуммаБазовая КАК СуммаБазовая,
	                      |	РасчетБонусовАналитикаРасчетов.СуммаРасчетная КАК СуммаРасчетная,
	                      |	РасчетБонусовНачисление.НачалоРасчета КАК НачалоРасчета,
	                      |	РасчетБонусовНачисление.КонецРасчета КАК КонецРасчета,
	                      |	РасчетБонусовАналитикаРасчетов.ИДУсловия КАК ИДУсловия
	                      |ИЗ
	                      |	Документ.РасчетБонусов.АналитикаРасчетов КАК РасчетБонусовАналитикаРасчетов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетБонусов.Начисление КАК РасчетБонусовНачисление
	                      |		ПО РасчетБонусовАналитикаРасчетов.Ссылка = РасчетБонусовНачисление.Ссылка
	                      |			И РасчетБонусовАналитикаРасчетов.УстановкаМаркетинга = РасчетБонусовНачисление.УстановкаМаркетинга
	                      |ГДЕ
	                      |	РасчетБонусовНачисление.Ссылка = &Ссылка
	                      |	И РасчетБонусовАналитикаРасчетов.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Движение = ргАналитикаНачисленияМаркетинга.Добавить();
		Движение.Активность = Истина;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;

	
КонецПроцедуры

Процедура ОбновитьСуммыТЧНачисления() Экспорт 			
	ТаблАналитики = АналитикаРасчетов.Выгрузить(,"УстановкаМаркетинга, ИДУсловия, ИДНачисления, СуммаБазовая, СуммаРасчетная");
	ТаблАналитики.Свернуть("УстановкаМаркетинга, ИДУсловия, ИДНачисления", "СуммаБазовая, СуммаРасчетная");
	
	Для Каждого Стр Из ТаблАналитики Цикл
		МассивСтрок = Расчеты.НайтиСтроки(Новый Структура("УстановкаМаркетинга, ИДУсловия", Стр.УстановкаМаркетинга, Стр.ИДУсловия));
		
		Для Каждого СтрМассива Из МассивСтрок Цикл
			СтрМассива.РасчетнаяБаза = Стр.СуммаБазовая;
			СтрМассива.СуммаРасчетная = Стр.СуммаРасчетная;
		КонецЦикла;
	КонецЦикла;
	
	ТаблСуммНачисления = ТаблАналитики.Скопировать();
	ТаблСуммНачисления.Свернуть("УстановкаМаркетинга, ИДНачисления", "СуммаРасчетная");
	
	Для Каждого Стр из ТаблСуммНачисления Цикл
		МассивСтрок = Начисление.НайтиСтроки(Новый Структура("УстановкаМаркетинга, ИДНачисления", Стр.УстановкаМаркетинга, Стр.ИДНачисления));
		
		Для Каждого СтрМассива Из МассивСтрок Цикл
			СтрМассива.СуммаРасчетная = Стр.СуммаРасчетная;			
		КонецЦикла;
	КонецЦикла;
	
	СписокУстановок = ТаблСуммНачисления.Скопировать();
	СписокУстановок.Свернуть("УстановкаМаркетинга");
	
	СуммыРасчетов = Расчеты.Выгрузить(,"УстановкаМаркетинга, СуммаРасчетная");
	СуммыРасчетов.Свернуть("УстановкаМаркетинга", "СуммаРасчетная");
	Для Каждого Стр Из СуммыРасчетов Цикл
		Если СписокУстановок.Найти(Стр.УстановкаМаркетинга, "УстановкаМаркетинга") <> Неопределено Тогда 
			Продолжить;	
		КонецЕсли;
		
		СтрУстановка = Начисление.Найти(Стр.УстановкаМаркетинга, "УстановкаМаркетинга");
		
		Если СтрУстановка<>Неопределено Тогда
			СтрУстановка.СуммаРасчетная = Стр.СуммаРасчетная;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
